tap "espanso/espanso"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "kanriapp/cask"
tap "minio/stable"
tap "thezoraiz/ascii-image-converter"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Development kit for the Java programming language
brew "openjdk@21"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# System monitoring dashboard for terminal
brew "gtop"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Fast and multi-purpose HTTP toolkit
brew "httpx"
# Configurable static site generator
brew "hugo", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Simple terminal UI for git commands
brew "lazygit"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Drop-in MySQL replacement
brew "percona-server", link: false
# Open source hot backup tool for InnoDB and XtraDB databases
brew "percona-xtrabackup"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tool for managing OCI containers and pods
brew "podman"
# Cross-platform library for audio I/O
brew "portaudio"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Modern Day Portscanner
brew "rustscan"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tools for building Android applications
cask "android-studio"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Desktop password and login vault
cask "bitwarden"
# Transcribes and translates audio
cask "buzz"
# Clipboard manager with advanced features
cask "copyq"
# Voice and text chat software
cask "discord"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# HTTP and GraphQL Client
cask "insomnia"
# Menu bar manager
cask "jordanbaird-ice"
# Offline Kanban board app
cask "kanri"
# GPU-based terminal emulator
cask "kitty"
# Custom Discord client
cask "legcord"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# IMAP email client
cask "mailmate"
# Utility to extend trackpad functionality
cask "middleclick"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Get up and running with large language models locally
cask "ollama-app"
# Spotify client
cask "psst"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# System monitor for the menu bar
cask "stats"
# Menu bar pomodoro timer
cask "tomatobar"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark-app"
mas "Amphetamine", id: 937984704
mas "Bitwarden 2", id: 1352778147
mas "CrystalFetch", id: 6454431289
mas "FocusFlights", id: 6648771147
mas "Horo", id: 1437226581
mas "iMovie", id: 408981434
mas "iTheory", id: 499346672
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Swift Playground", id: 1496833156
mas "TripMode", id: 1513400665
mas "Xcode", id: 497799835
vscode "catppuccin.catppuccin-vsc"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "chenzehua.cursor-dark-theme"
vscode "codezombiech.gitignore"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "liangruliu.customize-toolbar"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "redhat.java"
vscode "t3m1n4l.amoled-github"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "honnef.co/go/tools/cmd/staticcheck"

